# HasElevations Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElevationMarker..::..HasElevations Method
ElevationMarker Class See Also
---
Returns true if the ElevationMarker has at least one elevation view, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasElevations()
```

Visual Basic
---
```text
Public Function HasElevations As Boolean
```

Visual C++
---
```text
public:
bool HasElevations()
```

# ### Return Value
True if the ElevationMarker has at least one elevation view, false otherwise.
# See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace